Revit 2026 API

# ReinforcementRoundingManager Class

---

A base class providing access to reinforcement rounding overrides for structural elements.

SystemObject Autodesk.Revit.DB.StructureReinforcementRoundingManager Autodesk.Revit.DB.StructureFabricRoundingManager Autodesk.Revit.DB.StructureRebarRoundingManager

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReinforcementRoundingManager : IDisposable
```
```vb
Public Class ReinforcementRoundingManager
	Implements IDisposable
```
```cpp
public ref class ReinforcementRoundingManager : IDisposable
```
```fsharp
type ReinforcementRoundingManager =
    class
        interface IDisposable
    end
```

The ReinforcementRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Element | The owner of the reinforcement rounding overrides. |
|  | IsActiveOnElement | Defines whether reinforcement rounding is activated for the particular element. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReinforcementRoundingManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.

#### Reference

Autodesk.Revit.DB.Structure Namespace